IdeaRS.Connections
MemberGeneralWeldData Properties
Compatible with IDEA StatiCa 0.0
The MemberGeneralWeldData type exposes the following members.
Properties
Name | Description
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
SurfaceEdgeInx |  (Inherited from GeneralWeldData.)
Weld
 Gets or sets the properties of the connected member to plate weld
 (Inherited from GeneralWeldData.)
WeldedEdgeIndexes |  (Inherited from GeneralWeldData.)
WeldedEdgeInx |  (Inherited from GeneralWeldData.)
WeldedMemberEdgePath |  (Inherited from GeneralWeldData.)
WeldedMemberSurfacePath |  (Inherited from GeneralWeldData.)
WeldedPlateEdgePath |  (Inherited from GeneralWeldData.)
WeldedPlateSurfacePath |  (Inherited from GeneralWeldData.)
WeldPlacement |  (Inherited from GeneralWeldData.)
Top
See Also
Reference
MemberGeneralWeldData Class
IdeaRS.Connections.Data Namespace